Revit 2024 API
ViewCropRegionShapeManager.IsSplitHorizontally Property
 Whether or not the view's crop is split (and the split is horizontal).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsSplitHorizontally { get; }
Visual Basic
Public ReadOnly Property IsSplitHorizontally As Boolean
	Get
Visual C++
public:
property bool IsSplitHorizontally {
	bool get ();
}
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace